In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [5]:
# Question 1 - Load data set using pandas function and print last 5 records.
flightdf = pd.read_csv('flight.csv')
flightdf.head()

,year,month,day,dep_time,sched_dep_time,dep_delay,arr_time,sched_arr_time,arr_delay,carrier,flight,tailnum,origin,dest,air_time,distance,hour,minute,time_hour
0,2013,1,1,1455,1459,-4,1655,1645,10.0,B6,1053,N203JB,JFK,PIT,87.0,340,14,59,01-01-2013 14:00
1,2013,1,1,1455,1500,-5,1753,1810,-17.0,DL,1997,N997DL,LGA,PBI,152.0,1035,15,0,01-01-2013 15:00
2,2013,1,1,1456,1500,-4,1649,1632,17.0,UA,685,N802UA,LGA,ORD,140.0,733,15,0,01-01-2013 15:00
3,2013,1,1,1456,1455,1,1830,1813,17.0,UA,1134,N24212,EWR,AUS,252.0,1504,14,55,01-01-2013 14:00
4,2013,1,1,1457,1500,-3,1758,1815,-17.0,UA,379,N401UA,EWR,RSW,166.0,1068,15,0,01-01-2013 15:00

In [6]:
# Question 2 - Print the number of flight from one point to another. 
flightdf.size

3781

In [7]:
flightdf.shape

(199, 19)

In [8]:
# Question 3 - Find the best airline in terms of departure.

In [9]:
# Question 6 - Find the size and shape of data set 
print(flightdf.shape)
print(flightdf.size)

(199, 19)
3781

In [10]:
# Question 7 - Print all the column header of the dataframe
flightdf.columns

Index(['year', 'month', 'day', 'dep_time', 'sched_dep_time', 'dep_delay',
       'arr_time', 'sched_arr_time', 'arr_delay', 'carrier', 'flight',
       'tailnum', 'origin', 'dest', 'air_time', 'distance', 'hour', 'minute',
       'time_hour'],
      dtype='object')

In [12]:
# Question 8 - Remove all the duplicate values from the data frame
flightdf.duplicated().sum()

0

In [13]:
# there is no duplicate values in dataset but here is the code for remove duplicates
flightdf.drop_duplicates(inplace=True)

In [14]:
# Question 9 - Count the null values in the database and replace with mean value.
flightdf.isnull().sum()

year              0
month             0
day               0
dep_time          0
sched_dep_time    0
dep_delay         0
arr_time          0
sched_arr_time    0
arr_delay         3
carrier           0
flight            0
tailnum           0
origin            0
dest              0
air_time          3
distance          0
hour              0
minute            0
time_hour         0
dtype: int64

In [16]:
# there is null values in arr_delay
ardelay = flightdf['arr_delay']
ardelay.fillna(ardelay.median(),inplace=True)

In [17]:
ardelay.isnull().sum()

0